In [5]:
import seaborn as sns
print (sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [11]:
data= sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
data= sns.load_dataset('planets')
data.isna().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [23]:
data= sns.load_dataset('planets')
data.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [35]:
data['mass'].fillna(data['mass'].mean(),inplace=True)
data.isnull().sum()

C:\Users\mas12\AppData\Local\Temp\ipykernel_11524\3394068614.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['mass'].fillna(data['mass'].mean(),inplace=True)

method              0
number              0
orbital_period     43
mass                0
distance          227
year                0
dtype: int64

In [41]:
data['distance'].fillna(data['distance'].median(),inplace=True)
data.isnull().sum()

C:\Users\mas12\AppData\Local\Temp\ipykernel_11524\731365454.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['distance'].fillna(data['distance'].median(),inplace=True)

method             0
number             0
orbital_period    43
mass               0
distance           0
year               0
dtype: int64

In [51]:
data['orbital_period'].fillna(data['orbital_period'].mode(),inplace=True)
data.isnull().sum()

C:\Users\mas12\AppData\Local\Temp\ipykernel_11524\2948010115.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['orbital_period'].fillna(data['orbital_period'].mode(),inplace=True)

method            0
number            0
orbital_period    0
mass              0
distance          0
year              0
dtype: int64

In [61]:
data= data.drop('method',axis=1)

In [65]:
data.isnull().sum()

number            0
orbital_period    0
mass              0
distance          0
year              0
dtype: int64

In [69]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number          1035 non-null   int64
 1   orbital_period  1035 non-null   float64
 2   mass            1035 non-null   float64
 3   distance        1035 non-null   float64
 4   year            1035 non-null   int64
dtypes: float64(3), int64(2)
memory usage: 40.6 KB